Table of Contents
 Class PolygonPointID
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Polygon of pointIDs
[Obfuscation(Feature = "renaming")]
public class PolygonPointID
Inheritance
object
PolygonPointID
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PolygonPointID()
Constructor
public PolygonPointID()
Properties
 Points
Points
public List<PointOfID> Points { get; set; }
Property Value
List<PointOfID>
 Edit this page